export const propertis_zh={
    version:'zh',
    menu:[{name:'DAO 列表',link:'#/daolist'},
    {name:'IADD交易',link:'#/iadd'},
    {name:'创建DAO',link:'#/createdao'},
    {name:'提案管理',link:'#/prosoal'},
    {name:'我的',link:'#/my'},
    {name:'文档',link:'./dist/index.html',target:'_blank'}
    ],
    header:['连接钱包','退出钱包','安装metamask','连接中......','正在授权，请稍等......','搜索token','登录信息','正在取消授权，请稍等......','请连接钱包！'],
    w_tipMessage:'提示',
    daoList:['搜索项目名称/管理员地址','按时间','按名称','DAF地址','创建时间','币价','市值排名','总共有','当前页','总页数','按排名','单击进行搜索','选择'],
    siwe:['使用以太坊登录应用程序。','签名登录，请确认','该操作需要登录道易程','登录道易程'],
    swap:['输入','输出','选择通行证','兑换比率','兑换','没有连接钱包','余额','未授权！','授权','正在提交授权......','你正在出售','你将收到'
    ,'或者交易失败','兑换数不能为0','余额不足！','正在使用钱包提交请求......',"全局授权","取消授权"], //17
    noConnect:'没有连接钱包，无法操作',
    createDao:['注册dao','设置logo','发行token'],
    mymenu:['DETH','兑换记录','我的token','我的DAO','我的app'],
    my:['未锻造DETH','锻造','DETH余额','兑换','输入：','输出：','锻造中......','正在生成utoken......','名称','余额','符号'],
    register:['管理员地址','dao名称','dao符号','dao描述','注册','logo支持的文件类型：zip,svg,jpg,jpeg,png,gif,webp的图片！(备注：可以把svg,jpg,jpeg,png,gif,webp以zip的方式压缩后上传,svg文件只允许西文)'
    ,'图片文件不能大于10K！','正在注册DAO，请耐心等待...','DAO的名称 或 DAO 的符号已经被注册。','刷新','发行token','token',' 全局app地址','成员数量不能超过20'
    ,'成员不能重复！','注册信息的请求已通过钱包成功提交'],  //15
  //  daoselect:['选择DAO'],
  //  dian:['提案','提案方式'],
  promenu:['提案','投票/执行'],  
  pro:["提交","安装扩展提案",'修改logo提案','正在提交提案......','提案名称','提案日期','总票数','已投','投票','执行','提案类型','logo扩展app安装'
  ,'正在投票......','正在执行提案......'
  ,'地址','app 描述','正在上传app......','登记App信息','名称','app Id','已投票','安装','已安装','安装进行中...','存入','appset名称'
  ,'描述','修改logo==>',"撤销","确认要撤销吗?","撤销之后将不能再恢复，请确认！","确认","详情","app序号"],//33    

    logo:['设置logo','当前logo','已选择logo','logo已设置，需要通过提案的方式更改logo!','正在提交Logo,请耐心等待...','选择DAO','还没有选择logo！',
    'logo已设置，需要先安装修改的扩展，然后使用该扩展进行修改！','正在提交投票的签名......','正在执行提案......'],
    org:['注册org','rule地址比例','成员票权比例','单位:万分之1','更新比例','初始成员','票权','增加成员','删除成员','DAO已经创建OS， 不能再创建！','  正在注册org，请耐心等待...'
    ,'org名称','org的名称已经被注册。'],
    oss:['创建OS','内部投票器','外部投票器','内部票权数','外部票权数','初始成员','票权','增加成员','删除成员','已经创建OS！','正在创建OS，请耐心等待...'],
    token:['已经发行token， 不能重复发行！','正在发行token，请耐心等待...','发行token','未创建OS，不能发布token！','在注册时设置不允许发布token','单位：'],

    login:['登录帐号','网络号','eth余额','utoken余额'],
    daoselect:['选择我的DAO','刷新','dao logo'],
    logoselect:['选择logo','logo图片文件选择','已选择logo'],
    orgselect:['选择我的ORG','刷新数据'],
    errors:{
      mess:'数据检测失败，请纠正后再提交！',
      login1:'1. 电脑：浏览器没有安装metaMask插件, 建议使用metaMask. 链接：',
      login2:'2. 手机：直接使用 metamask APP 访问。',
      pro:['提案名称不能为空，不能大于128个字符！','该dao 未创建OS，不能提案!','该dao 没有设置logo,直接设置logo即可, 不需要提案修改logo。','该名称已存在， 请换另一个名称。'
      ,'没有安装修改logo的app, 请通过提案安装.','已经投票，不能重复投票。','未创建OS，不能安装app！','dao 已经安装该app, 不需要重复安装.'], //7
      org:['org名称不能为空，不能大于128个字符！','取值范围：1-10000的整数','成员地址:以0x开头,40个字符(数字和A-F组成)'],
      dao:['名称不能为空，不能大于128个字符！','dao符号不能为空，不能大于128个字符！','地址:以0x开头,40个字符(数字和A-F组成)','没有选择ORG！']
    },
    tips:[
         'rule地址比例：'
        ,'rule地址：rule合约负责读写各项数据（包括检查数据边界、数据有效性）。\r\n rule地址比例：当投票数达到该比例时，就可以修改rule合约。'
        ,'成员票权比例：'
        ,'当投票数达到该比例时，才能更改成员票权。（当rule合约替换成第三方合约之后，该参数可能会被第三方舍弃）'
        ,'更新比例：'
        ,'当投票数百分比达到该比例时，可以更新整个ORG版本。'
        ,'创建OS：'
        ,'创建OS就是部署DAO合约。每个DAO内部都有一系列合约。部署合约耗费GAS很高。因此，前面步骤设置DAO参数、设置logo图标，此处部署OS，虽然同属于DAO的创建，但必须分开。若合并操作，很容易因为GAS过高执行失败。'
        ,'提交请求产生错误，请在钱包中查看并处理！\r\n'
        ,'app安装'
        ,'关闭'
        ,'app地址登记'
        ,'app升级'
        ,'存入'
        ,'区块链速度慢，别着急' //14
        ,'有时候区块链会很慢，等待很长的时间，这是正常的' //15
        ,'正在上链中，请耐心等候' //16
        ,'已经设置logo， 没有创建OS，不能修改！' //17
        ,'已复制' //18
       ]
    

}